"u8sdk_current_language_type" = "en";
"u8_language_type_key" = "英语";

"u8_privacy_policy_guidelines" = "Privacy Agreement Protection Guidelines";
"u8_privacy_detail_thank" =  "Thank you for playing this game, you should read and agree that we will collect information about your device.";
"u8_user_services_agreement" = "\"User Service Agreement\"";
"u8_user_privacy_agreement" = "\"User Privacy Agreement\"";
"u8_privacy_detail_content" = ", if you refuse, you will not be able to enter the game. Please click to agree to start providing you with our services. In order to provide you with game services, we may obtain the following permissions and information during your use. View and manage your permissions in .\nDevice information: To facilitate you to retrieve lost account passwords and ensure account security.";
"u8_privacy_detail_all" = "Thank you for playing this game, you should read and agree that we will collect information about your device.\"User Service Agreement\" and \"User Privacy Agreement\", if you refuse, you will not be able to enter the game. Please click to agree to start providing you with our services. In order to provide you with game services, we may obtain the following permissions and information during your use. View and manage your permissions in .\nDevice information: To facilitate you to retrieve lost account passwords and ensure account security.";

"u8_user_exit_APP" = "Exit the App";
"u8_user_exit_login" = "Log out successfully";
"u8_user_loginSuccess_welcome" = "Login successfully, welcome!";




"u8_error_data_error" = "Data Error";
"u8_error_unknown_error" = "Unknown Error";
"u8_error_parameter_error" = "Illegal Request";
"u8_error_name_invalid" = "Name or number is not legal";
"u8_error_code_unsend" = "Error, verification code cannot be sent";
"u8_error_system_versionLow" = "System version is too low, iOS 13+ required";

"u8_tips_button_yes" = "Yes";
"u8_tips_button_no" = "No";
"u8_tips_button_ok" = "Confirm";
"u8_tips_button_cancel" = "Cancel";
"u8_tips_button_unBind" = "Unbound";
"u8_tips_button_alreadyBind" = "Account Bound";

"u8_account_login_success" = "Login Successful";
"u8_account_login_failed" = "Login Failed";
"u8_account_bind_success" = "Bound Successful";
"u8_account_bind_failed" = "Bound Failed";
"u8_account_unbind_success" = "Unbind Successful";
"u8_account_unbind_failed" = "Unbind Failed";
"u8_account_cutover_success" = "Switch Account Successful";
"u8_account_cutover_failed" = "Switch Account Failed";
"u8_account_cutover_abnormal" = "Switching account error";
"u8_account_verify_failed" = "Account status verification failed";
"u8_account_please_login" = "Please login first";
"u8_account_realname_success" = "Real-Name Authentication successful";
"u8_account_realname_failed" = "Real-name authentication failed";
"u8_account_realname_verified" = "Real-Name Authentication";

"u8_account_realname_noPass" = "Not passed real name authentication";
"u8_account_realname_pass" = "Real-Name Authentication successful";
"u8_account_realname_tips1" = "According to national laws and regulations, players need real-name authentication. For your game experience, please fill in your identity information, otherwise you will not be able to play normally.";
"u8_account_realname_tips2" = "According to the \"Notice on Preventing Minors from Indulging in Online Games\", game users should use valid identity documents to register with their real names, and we promise to protect your personal information in accordance with the law.";
"u8_account_UI_realname" = "Real Name";
"u8_account_UI_numberCard" = "ID Number";
"u8_account_UI_commit" = "Submit";
"u8_account_UI_current" = "Account";
"u8_account_UI_agreement" = "Terms of Services";
"u8_account_UI_service" = "Contact Customer Service";
"u8_account_UI_bind" = "Bind";
"u8_account_UI_unbind" = "Unbind";
"u8_account_UI_cutoverBind" = "Switch binding";
"u8_account_UI_noBind" = "Not Bound Yet";
"u8_account_UI_alreadyBind" = "bound";
"u8_account_UI_agree" = "Agree";

"u8_account_bind_tips1" = "Binding means agreeing";
"u8_account_privacy_policy" = "Privacy Policy";
"u8_account_code_sending" = "Sending";

"u8_account_show_copySuccess" = "Copied successfully";

"u8_account_center_tips" = "In order to prevent your data loss, please bind your account, and you can login on other devices after your account is bound";
"u8_account_title_info" = "Account Info.";
"u8_account_title_bind" = "Account Binding";
"u8_account_title_bindOrCutover" = "Bind or switch";
"u8_account_input_phoneNumber" = "Please enter your mobile number";
"u8_account_verification_code" = "Verification Code";
"u8_account_get_code" = "Get verification code";
"u8_account_code_send" = "Sending";
"u8_account_please_wait" = "Please wait a moment~";
"u8_account_oneClick_login" = "Local number one-click binding";
"u8_account_other_bind" = "Other binding methods";
"u8_account_getJGParameter_success" = "Access one-click login parameters successfully";
"u8_account_tips_pleaseAgree" = "Please agree to the terms and conditions first";
"u8_account_request_unHandle" = "Unable to process the behavior";
"u8_account_login_noSupport" = "This login method is not currently supported";

"u8_no_plugin_wx" = "Missing WeChat add-on";
"u8_no_plugin_qq" = "Missing QQ add-on";
"u8_no_plugin_fb" = "Missing Facebook add-on";
"u8_no_plugin_gg" = "Missing Google add-on";
"u8_no_plugin_any" = "No add-ons found for this platform";
"u8_no_plugin_account" = "Missing account system add-on";
//"u8_no_plugin_wx" = "缺少微信插件";
//"u8_no_plugin_wx" = "缺少微信插件";
//"u8_no_plugin_wx" = "缺少微信插件";

"u8_no_open_apple" = "Apple login module is not enabled";
"u8_no_open_wx" = "WeChat login module is not enabled";
//"u8_no_open_apple" = "Apple login module is not enabled";

"u8_no_install_wx" = "WeChat is not installed";

"u8_lack_module_fb" = "Facebook module is not enabled";
"u8_lack_module_gg" = "Google login module is not enabled";

"u8_wx_error_nodate" = "WeChat authorization has expired";
"u8_wx_error_open" = "Failed to open WeChat";
"u8_wx_error_login" = "WeChat login failed";
"u8_wx_error_authorize" = "WeChat authorization failed";
"u8_wx_success_authorize" = "WeChat authorized successfully";


"u8_ad_error_award" = "Reward distribution failed";
"u8_ad_error_cacheTimes" = "The cache count must be greater than 0";
"u8_ad_error_show" = "Failed to display ads";

"u8_account_platform_alreadyBind" = "You are already bound to the platform";
"u8_account_platform_noBind" = "You are not bound to the platform";
"u8_account_platform_unBind" = "Account Unbinding";
"u8_account_platform_unBindTips" = "Are you sure to unbind?";

"u8_phone_save_failed" = "Failed to save picture to album";
"u8_phone_save_success" = "Save picture to album successfully";

"u8_apple_login_canceled" = "Canceled authorization login request";
"u8_apple_login_failed" = "Authorization request failed";
"u8_apple_login_invalidResponse" = "Authorization Error Invalid Response";
"u8_apple_login_notHandled" = "Failed to process authorization request";
"u8_apple_login_unknown" = "Authorization request failed for unknown reasons";
"u8_apple_login_success" = "Apple Authorization login successful";

"u8_apple_pay_failed" = "Payment Failed";
"u8_apple_no_open" = "In-app purchase is not enabled";
"u8_apple_create_order" = "Order being created";
"u8_apple_link_AppStore" = "Connecting to the App Store";
"u8_apple_create_orderFailed" = "Order creation failed";
"u8_apple_product_noFind" = "Product information not found";
"u8_apple_buy_waiting" = "Purchasing, please wait";
"u8_apple_ok_waiting" = "Waiting for confirmation";
"u8_apple_return_buyData" = "Purchase data being returned";
"u8_apple_lost_orderData" = "Order information is lost";
"u8_apple_pay_buyFailed" = "Purchase failed";
"u8_apple_pay_receiptURLFailed" = "Unable to retrieve ReceiptURL";
"u8_apple_pay_success" = "Purchase succeeded";
"u8_apple_shipment_failed" = "Failed to deliver";
"u8_apple_no_handle" = "Unable to pay";
"u8_apple_order_handle" = "Processing order...";
"u8_apple_order_handleNum" = "Processing the %ldth order";
"u8_apple_shipment_success" = "Successfully Shipped";
"u8_apple_order_handleOver" = "Order processing complete";
"u8_apple_order_failedAll" = "The order processing failed, please check your current network environment. If there is no abnormality in the network environment, you can try to exit the current game and re-enter.";
"u8_apple_order_failedPart" = "The order processing is complete, and %ld orders failed to process. Please check your current network environment. If there is no abnormality in the network environment, you can try to exit the current game and re-enter.";
"u8_apple_order_noti" = "Notice";
"u8_apple_order_sure" = "OK";
"u8_apple_order_willHandle" = "You have %ld paid orders pending, now we will process them for you.";

"u8_applePay_failedStatus_1" = "Cancel Payment";
"u8_applePay_failedStatus_2" = "Unknown or unexpected error occurred";
"u8_applePay_failedStatus_3" = "The client is not allowed to send requests";
"u8_applePay_failedStatus_4" = "App Store cannot recognize payment parameters";
"u8_applePay_failedStatus_5" = "No payment allowed for this device";
"u8_applePay_failedStatus_6" = "The requested product is not available in the store";
"u8_applePay_failedStatus_7" = "Access to cloud service information is not allowed";
"u8_applePay_failedStatus_8" = "The device cannot connect to the network";
"u8_applePay_failedStatus_9" = "Permission to use this cloud service has been revoked";
"u8_applePay_failedStatus_10" = "Users need to agree to Apple's privacy policy";
"u8_applePay_failedStatus_11" = "The program does not have access to this property";
"u8_applePay_failedStatus_12" = "Quote identifier not found or invalid";
"u8_applePay_failedStatus_13" = "The provided cryptographic signature is invalid";
"u8_applePay_failedStatus_14" = "Missing one or more parameters";
"u8_applePay_failedStatus_15" = "The price of the selected offer is invalid";
"u8_applePay_failedStatus_16" = "Unknown error occurred";

"u8_appleProduct_question_success" = "Product information search successful";
"u8_appleProduct_question_failed" = "Failed to check product information";
"u8_appleProduct_ID_Null" = "Product ID is empty";
"u8_appleProduct_getInfo_load" = "Accessing product information";
"u8_appleProduct_request_timeout" = "Request Timeout";

"u8_share_share_success" = "Shared successfully";
"u8_share_share_failed" = "Failed to share";
"u8_share_share_cancel" = "Unshare";

"u8_web_tips_loadFailed" = "Loading failed, please check the network";

"u8_account_UI_otherPhone" = "Login with other phone number";
"u8_account_UI_loginAndBind" = "One-click login and registration with this phone number";
"u8_account_UI_phoneLogin" = "Login with phone number";
"u8_account_UI_phoneLoginDetail" = "Unregistered phone number will be registered directly after verification";
"u8_account_bind_tips1" = "Binding represents agreement";
"u8_account_UI_sendCountdown" = "Resend after %ld seconds";
"u8_account_UI_phoneNumber" = "Phone number";
"u8_account_UI_btnLogin" = "Login";
"u8_account_UI_tipsCode" = "Please enter verification code";
"u8_account_UI_tipsPhone" = "Please enter a valid phone number";
"u8_account_UI_loginAgreement" = "Agree to login";
"u8_account_UI_usePhone" = "And login with this phone number";
"u8_account_UI_loginQuestion" = "Login related questions";
"u8_account_UI_unableBind" = "Unable to bind or login";
"u8_account_UI_contactService" = "Contact customer service";

"u8_account_complaint_complaint" = "Change Binding Appeal";
"u8_account_complaint_enterAccount " = "Real-name Verification: Enter Original Account Real-name Information";
"u8_account_complaint_originalPhone" = "Original Phone Number";
"u8_account_complaint_inputRealname" = "Please Enter Real Name";
"u8_account_complaint_inputCardnumber" = "Please Enter ID Card Number";
"u8_account_complaint_name" = "Name";
"u8_account_complaint_enterAccount" = "Real-name Verification: Enter Original Account Real-name Information";
"u8_account_complaint_tipsCardNumber" = "Please Enter a Valid ID Card Number";
"u8_account_info_account" = "Account";
"u8_account_info_realName" = "Real Name";
"u8_account_info_memberCard" = "ID Card";
"u8_account_info_cutoverBind" = "Change Binding";
"u8_account_info_cutoverAccount" = "Switch Account";
"u8_account_cutove_title" = "Change Binding";
"u8_account_cutove_verify" = "Verify";
"u8_account_cutove_newPhone" = "New Phone Number";
"u8_account_cutove_accountCutover" = "Switch Account";
"u8_account_tips_cancelLogin" = "Cancel Login";
"u8_account_tips_sendSMSFailed" = "Failed to Send SMS";
"u8_account_tips_jgloginFailed" = "Failed to Login/Register with Current Phone Number, Please Use SMS Verification Code to Login/Register";
"u8_account_tips_phoneCheckPhone" = "Phone Number Verification Failed";
"u8_account_tips_phoneCheckDifferent" = "The Phone Number Entered Must be Different from the Logged-in Account Phone Number";
"u8_account_tips_tokenIsNull" = "Token is Empty";
"u8_account_tips_submissionFailed" = "Submission Failed";
"u8_account_tips_submissionSuccess" = "Submission Successful";
"u8_account_tips_appealChangeFailed" = "Account Appeal Failed";
"u8_account_appealSuccess_welcome" = "Account Appeal Successful, Welcome!";
"u8_account_cutoverSuccess_welcome" = "Account Switch Successful, Welcome!";
"u8_account_tips_loginTypeError" = "Login Type Error";
"u8_account_UI_help" = "Help";
